Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV256GM004.h
#define _SENT1DATH_DATA22_POSITION               0x00000006
#define _SENT1DATH_DATA22_MASK                   0x00000040
#define _SENT1DATH_DATA22_LENGTH                 0x00000001

#define _SENT1DATH_DATA23_POSITION               0x00000007
#define _SENT1DATH_DATA23_MASK                   0x00000080
#define _SENT1DATH_DATA23_LENGTH                 0x00000001

#define _SENT1DATH_DATA10_POSITION               0x00000008
#define _SENT1DATH_DATA10_MASK                   0x00000100
#define _SENT1DATH_DATA10_LENGTH                 0x00000001

#define _SENT1DATH_DATA11_POSITION               0x00000009
#define _SENT1DATH_DATA11_MASK                   0x00000200
#define _SENT1DATH_DATA11_LENGTH                 0x00000001

#define _SENT1DATH_DATA12_POSITION               0x0000000A
#define _SENT1DATH_DATA12_MASK                   0x00000400
#define _SENT1DATH_DATA12_LENGTH                 0x00000001

#define _SENT1DATH_DATA13_POSITION               0x0000000B
#define _SENT1DATH_DATA13_MASK                   0x00000800
#define _SENT1DATH_DATA13_LENGTH                 0x00000001

#define _SENT1DATH_STAT0_POSITION                0x0000000C
#define _SENT1DATH_STAT0_MASK                    0x00001000
#define _SENT1DATH_STAT0_LENGTH                  0x00000001

#define _SENT1DATH_STAT1_POSITION                0x0000000D
#define _SENT1DATH_STAT1_MASK                    0x00002000
#define _SENT1DATH_STAT1_LENGTH                  0x00000001

#define _SENT1DATH_STAT2_POSITION                0x0000000E
#define _SENT1DATH_STAT2_MASK                    0x00004000
#define _SENT1DATH_STAT2_LENGTH                  0x00000001

#define _SENT1DATH_STAT3_POSITION                0x0000000F
#define _SENT1DATH_STAT3_MASK                    0x00008000
#define _SENT1DATH_STAT3_LENGTH                  0x00000001

#define _SENT2CON1_NIBCNT_POSITION               0x00000000
#define _SENT2CON1_NIBCNT_MASK                   0x00000007
#define _SENT2CON1_NIBCNT_LENGTH                 0x00000003

#define _SENT2CON1_PS_POSITION                   0x00000004
#define _SENT2CON1_PS_MASK                       0x00000010
#define _SENT2CON1_PS_LENGTH                     0x00000001

#define _SENT2CON1_SPCEN_POSITION                0x00000006
#define _SENT2CON1_SPCEN_MASK                    0x00000040
#define _SENT2CON1_SPCEN_LENGTH                  0x00000001

#define _SENT2CON1_PPP_POSITION                  0x00000007
#define _SENT2CON1_PPP_MASK                      0x00000080
#define _SENT2CON1_PPP_LENGTH                    0x00000001

#define _SENT2CON1_CRCEN_POSITION                0x00000008
#define _SENT2CON1_CRCEN_MASK                    0x00000100
#define _SENT2CON1_CRCEN_LENGTH                  0x00000001

#define _SENT2CON1_TXPOL_POSITION                0x00000009
#define _SENT2CON1_TXPOL_MASK                    0x00000200
#define _SENT2CON1_TXPOL_LENGTH                  0x00000001

#define _SENT2CON1_TXM_POSITION                  0x0000000A
#define _SENT2CON1_TXM_MASK                      0x00000400
#define _SENT2CON1_TXM_LENGTH                    0x00000001

#define _SENT2CON1_RCVEN_POSITION                0x0000000B
#define _SENT2CON1_RCVEN_MASK                    0x00000800
#define _SENT2CON1_RCVEN_LENGTH                  0x00000001

#define _SENT2CON1_SNTSIDL_POSITION              0x0000000D
#define _SENT2CON1_SNTSIDL_MASK                  0x00002000
#define _SENT2CON1_SNTSIDL_LENGTH                0x00000001

#define _SENT2CON1_SNTEN_POSITION                0x0000000F
#define _SENT2CON1_SNTEN_MASK                    0x00008000
#define _SENT2CON1_SNTEN_LENGTH                  0x00000001

#define _SENT2STAT_SYNC_POSITION                 0x00000000
#define _SENT2STAT_SYNC_MASK                     0x00000001
#define _SENT2STAT_SYNC_LENGTH                   0x00000001

#define _SENT2STAT_RXIDLE_POSITION               0x00000001
#define _SENT2STAT_RXIDLE_MASK                   0x00000002
#define _SENT2STAT_RXIDLE_LENGTH                 0x00000001

#define _SENT2STAT_FRMERR_POSITION               0x00000002
#define _SENT2STAT_FRMERR_MASK                   0x00000004
#define _SENT2STAT_FRMERR_LENGTH                 0x00000001

#define _SENT2STAT_CRCERR_POSITION               0x00000003
#define _SENT2STAT_CRCERR_MASK                   0x00000008
#define _SENT2STAT_CRCERR_LENGTH                 0x00000001

#define _SENT2STAT_NIB_POSITION                  0x00000004
#define _SENT2STAT_NIB_MASK                      0x00000070
#define _SENT2STAT_NIB_LENGTH                    0x00000003

#define _SENT2STAT_PAUSE_POSITION                0x00000007
#define _SENT2STAT_PAUSE_MASK                    0x00000080
#define _SENT2STAT_PAUSE_LENGTH                  0x00000001

#define _SENT2STAT_TXEN_POSITION                 0x00000000
#define _SENT2STAT_TXEN_MASK                     0x00000001
#define _SENT2STAT_TXEN_LENGTH                   0x00000001

#define _SENT2STAT_NIB0_POSITION                 0x00000004
#define _SENT2STAT_NIB0_MASK                     0x00000010
#define _SENT2STAT_NIB0_LENGTH                   0x00000001

#define _SENT2STAT_NIB1_POSITION                 0x00000005
#define _SENT2STAT_NIB1_MASK                     0x00000020
#define _SENT2STAT_NIB1_LENGTH                   0x00000001

#define _SENT2STAT_NIB2_POSITION                 0x00000006
#define _SENT2STAT_NIB2_MASK                     0x00000040
#define _SENT2STAT_NIB2_LENGTH                   0x00000001

#define _SENT2DATL_CRC_POSITION                  0x00000000
#define _SENT2DATL_CRC_MASK                      0x0000000F
#define _SENT2DATL_CRC_LENGTH                    0x00000004

#define _SENT2DATL_DATA6_POSITION                0x00000004
#define _SENT2DATL_DATA6_MASK                    0x000000F0
#define _SENT2DATL_DATA6_LENGTH                  0x00000004

#define _SENT2DATL_DATA5_POSITION                0x00000008
#define _SENT2DATL_DATA5_MASK                    0x00000F00
#define _SENT2DATL_DATA5_LENGTH                  0x00000004

#define _SENT2DATL_DATA4_POSITION                0x0000000C
#define _SENT2DATL_DATA4_MASK                    0x0000F000
#define _SENT2DATL_DATA4_LENGTH                  0x00000004

#define _SENT2DATL_CRC0_POSITION                 0x00000000
#define _SENT2DATL_CRC0_MASK                     0x00000001
#define _SENT2DATL_CRC0_LENGTH                   0x00000001

#define _SENT2DATL_CRC1_POSITION                 0x00000001
#define _SENT2DATL_CRC1_MASK                     0x00000002
#define _SENT2DATL_CRC1_LENGTH                   0x00000001

#define _SENT2DATL_CRC2_POSITION                 0x00000002
#define _SENT2DATL_CRC2_MASK                     0x00000004
#define _SENT2DATL_CRC2_LENGTH                   0x00000001

